app/models/cart.rb

  def add_product(product, quantity = 1)
    current_item = cart_items.find_by(product_id: product.id)

    if current_item
      current_item.increment(:quantity, quantity)
      current_item.save
    else
      cart_items.create(product: product, quantity: quantity, price: product.price)
---
INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES ('b0f1973f-318f-4c72-9fd6-5c3a102dc730', '003f79cc-e3e3-4327-a800-faa7f9cb3b7e', 2, 299.9, '2025-12-23 23:45:30.168700', '2025-12-23 23:45:30.168700') RETURNING "id"